/*********************************************************
模块名       : 
文件名       :SrvHelloThread.cpp
相关文件     :SrvHelloThread.hpp
文件实现功能 :Hello服务包处理实现文件
作者         :zhangzx 
版本         :1.0 
**********************************************************/
#include "SrvHelloThread.hpp"
#include "NDFunc.hpp"
#include "SrvHelloPkt.hpp"

/*********************************************************
函数说明：构造函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CSrvHelloThread::CSrvHelloThread()
{
}

/*********************************************************
函数说明：创建新包
入参说明：
出参说明：
返回值  ：
*********************************************************/
CPacket* CSrvHelloThread::GetNewPkt()
{
	CPacket *pkt = new CSrvHelloPkt();
	return pkt;
}


/*********************************************************
函数说明：析构函数
入参说明：
出参说明：
返回值  ：
*********************************************************/
CSrvHelloThread::~CSrvHelloThread()
{
}

